driver-tests/bpelse/dynamicpartnerlink/correlation/FlowAsStartActivityJBI/test/flowWith3ReceivesTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">
  <soapenv:Body>
    <dat:helloObj>
      <dat:recursive>
          <dat:recursive>
              <dat:string>Invoke_ReqResp</dat:string>
              <dat:int>3</dat:int>
              <!--Zero or more repetitions:-->
              <dat:long>10</dat:long>
              <dat:double>1.051732E7</dat:double>        
          </dat:recursive>
          <dat:string>Invoke_ReqResp</dat:string>
          <dat:int>3</dat:int>
          <!--Zero or more repetitions:-->
          <dat:long>10</dat:long>
          <dat:double>1.051732E7</dat:double>        
      </dat:recursive>       
      <!--Zero or more repetitions:-->
      <dat:string>Value Sent </dat:string>
      <!--Zero or more repetitions:-->
      <dat:int>?3?</dat:int>
    </dat:helloObj>
  </soapenv:Body>
</soapenv:Envelope>