driver-tests/bpelse/dynamicpartnerlink/correlation/CorrelationTwoPropJBI/test/results/Rec_RecInFlow_InitNo/Actual_20130314133728_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd" xmlns:msgns="Rec_RecInFlow_Parent_WSDL_TNS">
      <string>[Input String][Branch1][Second Receive In Flow Branch-Input String][Branch3]</string>
      <int>24690</int>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>